Core/src/src/Catalogs/ВнеоборотныеАктивы/ВнеоборотныеАктивы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВнеоборотныеАктивы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыВнеоборотныхАктивов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетАмортизации</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособАмортизации</name>
    <type>
      <types>EnumRef.СпособыНачисленияАмортизацииВнеоборотныхАктивов</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьВНУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетАмортизацииРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВнеоборотныеАктивы</name>
    <type>
      <types>CatalogRef.ТипОсновныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодовойПроцентАмортизацииДляУменьшенногоОстатка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛиквидационнаяСтоимостьДляУменьшенногоОстатка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяСтоимостьДляУменьшенногоОстатка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КадастровыйКод</name>
    <comment>ONESOFT-2337</comment>
    <type>
      <types>CatalogRef.КадастровыеКоды</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентНалогаИмущества</name>
    <comment>ONESOFT-2337</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПокупки</name>
    <comment>ONESOFT-2337</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AzRyОтветственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRytmpАмортизационнаяГруппа</name>
    <type>
      <types>CatalogRef.AzRytmpОПТИМУС_АмортизационныеГруппы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/src/InformationRegisters/РыночныеЦеныВА/РыночныеЦеныВА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РыночныеЦеныВА</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Имущество</name>
    <type>
      <types>CatalogRef.ВнеоборотныеАктивы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/src/Enums/СпособыНачисленияАмортизацииВнеоборотныхАктивов/СпособыНачисленияАмортизацииВнеоборотныхАктивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыНачисленияАмортизацииВнеоборотныхАктивов</name>
  <enumValues>
    <name>Линейный</name>
  </enumValues>
  <enumValues>
    <name>ПропорциональноОбъемуПродукции</name>
  </enumValues>
  <enumValues>
    <name>УменьшенногоОстатка</name>
  </enumValues>
</mdclass:Enum>

Core/src/src/Catalogs/ВнеоборотныеАктивы/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПропорциональноОбъемуПродукции = Перечисления.СпособыНачисленияАмортизацииВнеоборотныхАктивов.ПропорциональноОбъемуПродукции;
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	
	Если Объект.СпособАмортизации = ПропорциональноОбъемуПродукции Тогда
		Элементы.ЕдиницаИзмерения.Видимость = Истина;
	Иначе
		Элементы.ЕдиницаИзмерения.Видимость = Ложь;
		Объект.ЕдиницаИзмерения = Неопределено;
	КонецЕсли;
	
	ОтчетыУНФ.ПриСозданииНаСервереФормыСвязанногоОбъекта(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.Печать
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	Элементы.ГруппаУСН.Доступность = Объект.УчитыватьВНУ;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		ПолучитьДанныеФормы();
	КонецЕсли;
	
	РазрешенПросмотрЦен = Истина;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	УстановитьВидимостьРеквизитов();
	
	//+++ Дмгг
	МесячныйПроцентУменьшенногоОстатка = Объект.ГодовойПроцентАмортизацииДляУменьшенногоОстатка / 12;
	//--- Дмгг
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменилисьСчетаВнеоборотныеАктивы" Тогда
		Объект.СчетУчета = Параметр.СчетУчета;
		Объект.СчетАмортизации = Параметр.СчетАмортизации;
		//+++
		Объект.СчетУчетаРегл = Параметр.СчетУчетаРегл;
		Объект.СчетАмортизацииРегл = Параметр.СчетАмортизацииРегл;
		//---
		//--------------------------------------------------------------------------
		// © Шишка В.В. [7 августа 2023]  НАЧАЛО
		Объект.ТипВнеоборотныеАктивы = Параметр.ТипВнеоборотныеАктивы;	
		// © Шишка В.В. [7 августа 2023]  КОНЕЦ
		//--------------------------------------------------------------------------
		
		Модифицированность = Истина;
		
	ИначеЕсли ИмяСобытия = "ИзмененаРыночнаяЦена"
		И Параметр Тогда
		
		ПодключитьОбработчикОжидания("ОбработкаОповещенияЗаписьВРегистреЦенКлиент", 0.5, Истина);
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	Если ЗначениеЗаполнено(Объект.ТипВнеоборотныеАктивы) Тогда
		ТекущийОбъект.СчетУчетаРегл = Объект.ТипВнеоборотныеАктивы.СчетУчетаРегл;
		ТекущийОбъект.СчетАмортизацииРегл  = Объект.ТипВнеоборотныеАктивы.СчетАмортизацииРегл;
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
// Процедура обработчик события ПриИзменении поля ввода СпособАмортизации.
//
Процедура СпособАмортизацииПриИзменении(Элемент)
	
	УстановитьВидимостьРеквизитов();
	
КонецПроцедуры // СпособАмортизацииПриИзменении()

&НаКлиенте
Процедура УчитыватьВНУПриИзменении(Элемент)
	Элементы.ГруппаУСН.Доступность = Объект.УчитыватьВНУ;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьРеквизитов()
	
	Если Объект.СпособАмортизации = ПропорциональноОбъемуПродукции Тогда
		Элементы.ЕдиницаИзмерения.Видимость = Истина;
		Элементы.ГруппаУменьшенногоОстатка.Видимость = Ложь;
		Элементы.НачальнаяСтоимостьВалютаУчета.Видимость = Истина;
	//+++ Дмгг
	ИначеЕсли Объект.СпособАмортизации = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииВнеоборотныхАктивов.УменьшенногоОстатка") Тогда
		Элементы.ЕдиницаИзмерения.Видимость = Ложь;
		Объект.ЕдиницаИзмерения = Неопределено;
		Элементы.НачальнаяСтоимостьВалютаУчета.Видимость = Ложь;
		Элементы.ГруппаУменьшенногоОстатка.Видимость = Истина;
	//--- Дмгг
	Иначе
		Элементы.ЕдиницаИзмерения.Видимость = Ложь;
		Объект.ЕдиницаИзмерения = Неопределено;
		Элементы.ГруппаУменьшенногоОстатка.Видимость = Ложь;
		Элементы.НачальнаяСтоимостьВалютаУчета.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидимостьРеквизитов()

#КонецОбласти

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	Если НЕ ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтаФорма, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтаФорма, ИмяЭлемента, РезультатВыполнения);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_РедактироватьСоставСвойств()
	УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтотОбъект, Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()

	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини
КонецПроцедуры

&НаКлиенте
Процедура ГодовойПроцентАмортизацииДляУменьшенногоОстаткаПриИзменении(Элемент)
	
	МесячныйПроцентУменьшенногоОстатка = Объект.ГодовойПроцентАмортизацииДляУменьшенногоОстатка / 12;
	
КонецПроцедуры

&НаКлиенте
Процедура НачальнаяСтоимостьДляУменшенногоОстаткаПриИзменении(Элемент)
	объект.НачальнаяСтоимость = Объект.НачальнаяСтоимостьДляУменьшенногоОстатка;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовуюРыночнуюЦену(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СозданиеЦеныПоказатьВопрос();
	Иначе
		СозданиеЦеныОткрытьФормуЗаписи();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СозданиеЦеныПоказатьВопрос()
	
	ТекстВопроса = НСтр("ka='ფასის დაყენებამდე საჭიროა ობიექტის ჩაწერა. ჩავწეროთ?';ru='Перед установлением цены необходимо записать объект. Записать?';en='Before setting the price you want to record the object. Record?'");
	Ответ = Неопределено;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("СозданиеЦеныОбработатьОтвет", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура СозданиеЦеныОбработатьОтвет(Результат, ДополнительныеПараметры) Экспорт
	
	Ответ = Результат;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Записать();
	Иначе
		Возврат;
	КонецЕсли;
	
	СозданиеЦеныОткрытьФормуЗаписи();
	
КонецПроцедуры

&НаКлиенте
Процедура СозданиеЦеныОткрытьФормуЗаписи()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПараметрыФормы = Новый Структура("Имущество", Объект.Ссылка);
		ОткрытьФорму("РегистрСведений.РыночныеЦеныВА.Форма.ФормаЗаписи", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура АктуальныеЦеныУдалитьЭлементы()
	
	Итератор = Элементы.АктуальныеЦены.ПодчиненныеЭлементы.Количество() - 1;
	Пока Итератор >= 0 Цикл
		Элементы.Удалить(Элементы.АктуальныеЦены.ПодчиненныеЭлементы[Итератор]);
		Итератор = Итератор - 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеФормы(Области = Неопределено)
	
	ЗапросТекстАктуальныеЦены = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
	|	ЦеныНоменклатурыСрезПоследних.Период
	|ИЗ
	|	РегистрСведений.РыночныеЦеныВА.СрезПоследних(
	|			&ТекущаяДата,
	|			Имущество = &Имущество) КАК ЦеныНоменклатурыСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	Цена УБЫВ";
	ЗапросТекстАктуальныеЦеныНомерВПакете = 1;
	//
	//Если ЗначениеЗаполнено(ДиаграммаЦеныПериод) ИЛИ ЗначениеЗаполнено(Области) Тогда
	//	ЗапросТекстДинамикаЦен =
	//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	|	НАЧАЛОПЕРИОДА(ЦеныНоменклатуры.Период, %ПериодДетализации%) КАК Период,
	//	|	СРЕДНЕЕ(ЦеныНоменклатуры.Цена) КАК Цена,
	//	|	ЦеныНоменклатуры.ВидЦен КАК ВидЦен
	//	|ИЗ
	//	|	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	//	|ГДЕ
	//	|	ЦеныНоменклатуры.Номенклатура = &Номенклатура
	//	|	И ЦеныНоменклатуры.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	//	|	И ЦеныНоменклатуры.Актуальность
	//	|	И &ДиаграммаЦеныДатаНачала
	//	|	И &ДиаграммаЦеныДатаОкончания
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ЦеныНоменклатуры.ВидЦен,
	//	|	НАЧАЛОПЕРИОДА(ЦеныНоменклатуры.Период, %ПериодДетализации%)
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	Период
	//	|ИТОГИ ПО
	//	|	Период";
	//	ЗапросТекстДинамикаЦенНомерВПакете = 1;
	//Иначе
	//	ДиаграммаЦеныУстановитьПериодичность(ТипЕдиницыИнтервалаВремениАнализаДанных.День);
	//	ЗапросТекстДинамикаЦен = 
	//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 5
	//	|	НАЧАЛОПЕРИОДА(ЦеныНоменклатуры.Период, %ПериодДетализации%) КАК Период,
	//	|	СРЕДНЕЕ(ЦеныНоменклатуры.Цена) КАК Цена,
	//	|	ЦеныНоменклатуры.ВидЦен КАК ВидЦен
	//	|ПОМЕСТИТЬ Цены
	//	|ИЗ
	//	|	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	//	|ГДЕ
	//	|	ЦеныНоменклатуры.Номенклатура = &Номенклатура
	//	|	И ЦеныНоменклатуры.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	//	|	И ЦеныНоменклатуры.Актуальность
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ЦеныНоменклатуры.ВидЦен,
	//	|	НАЧАЛОПЕРИОДА(ЦеныНоменклатуры.Период, %ПериодДетализации%)
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	Период УБЫВ
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	Цены.Период КАК Период,
	//	|	Цены.Цена,
	//	|	Цены.ВидЦен
	//	|ИЗ
	//	|	Цены КАК Цены
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	Период
	//	|ИТОГИ ПО
	//	|	Период";
	//	ЗапросТекстДинамикаЦенНомерВПакете = 2;
	//КонецЕсли;
	//
	//ЗапросТекстОстатки = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	//|	ЗапасыОстатки.Характеристика КАК Характеристика,
	//|	ЗапасыОстатки.Партия КАК Партия,
	//|	ЗапасыОстатки.КоличествоОстаток КАК Резерв
	//|ПОМЕСТИТЬ ВременнаяТаблицаРезервы
	//|ИЗ
	//|	РегистрНакопления.Запасы.Остатки(
	//|			,
	//|			Номенклатура = &Номенклатура
	//|				И ЗаказПокупателя ССЫЛКА Документ.ЗаказПокупателя
	//|				И НЕ ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)) КАК ЗапасыОстатки
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	//|	ЗапасыОстатки.Характеристика КАК Характеристика,
	//|	ЗапасыОстатки.Партия КАК Партия,
	//|	ЗапасыОстатки.КоличествоОстаток КАК Остаток,
	//|	0 КАК Резерв
	//|ПОМЕСТИТЬ ВременнаяТаблицаОстаткиИРезервы
	//|ИЗ
	//|	РегистрНакопления.Запасы.Остатки(, Номенклатура = &Номенклатура) КАК ЗапасыОстатки
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	Резервы.СтруктурнаяЕдиница,
	//|	Резервы.Характеристика,
	//|	Резервы.Партия,
	//|	0,
	//|	Резервы.Резерв
	//|ИЗ
	//|	ВременнаяТаблицаРезервы КАК Резервы
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ОстаткиРезервы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	//|	ОстаткиРезервы.Характеристика КАК Характеристика,
	//|	ОстаткиРезервы.Партия КАК Партия,
	//|	СУММА(ОстаткиРезервы.Остаток) КАК Остаток,
	//|	СУММА(ОстаткиРезервы.Резерв) КАК Резерв
	//|ИЗ
	//|	ВременнаяТаблицаОстаткиИРезервы КАК ОстаткиРезервы
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ОстаткиРезервы.СтруктурнаяЕдиница,
	//|	ОстаткиРезервы.Характеристика,
	//|	ОстаткиРезервы.Партия
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Характеристика,
	//|	СтруктурнаяЕдиница
	//|ИТОГИ ПО
	//|	Характеристика,
	//|	СтруктурнаяЕдиница
	//|АВТОУПОРЯДОЧИВАНИЕ";
	//ЗапросТекстОстаткиНомерВПакете = 3;
	
	РазделительЗапросов = 
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	Если Области = Неопределено Тогда
		Области = Новый Массив;
		
		Если Истина Тогда //РазрешенПросмотрЦен Тогда
			Области.Добавить("АктуальныеЦены");
			//Области.Добавить("ДиаграммаЦены");
		КонецЕсли;
		//Если РазрешенПросмотрПродаж Тогда
		//	Области.Добавить("ДиаграммаПродажи");
		//КонецЕсли;
		//Если РазрешенПросмотрОстатков Тогда
		//	Области.Добавить("Остатки");
		//КонецЕсли;
		
	Иначе
		
		Если ТипЗнч(Области) = Тип("Строка") Тогда
			ОбластиСтрока = Области;
			Области = Новый Массив;
			Области.Добавить(ОбластиСтрока);
		КонецЕсли;
		
		Для каждого Область Из Области Цикл
			
			Если (Область = "АктуальныеЦены" ИЛИ Область = "ДиаграммаЦены")
				И НЕ РазрешенПросмотрЦен Тогда
				Область = Неопределено;
			КонецЕсли;
			
			//Если Область = "ДиаграммаПродажи" И НЕ РазрешенПросмотрПродаж Тогда
			//	Область = Неопределено;
			//КонецЕсли;
			//
			//Если Область = "Остатки" И НЕ РазрешенПросмотрОстатков Тогда
			//	Область = Неопределено;
			//КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	//
	Запрос = Новый Запрос;
	СтекИтоговыхЗапросов = 0;
	текстДиаграммаЦеныПериодичность = "День";

	Для каждого Область ИЗ Области Цикл
	//	
		Если Область = "АктуальныеЦены" И Истина Тогда //РазрешенПросмотрЦен Тогда
			
			Если ЗначениеЗаполнено(Запрос.Текст) Тогда
				Запрос.Текст = Запрос.Текст + РазделительЗапросов;
			КонецЕсли;
			
			Запрос.Текст = Запрос.Текст + ЗапросТекстАктуальныеЦены;
			Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
			СтекИтоговыхЗапросов = СтекИтоговыхЗапросов + ЗапросТекстАктуальныеЦеныНомерВПакете;
			ЗапросТекстАктуальныеЦеныНомерВПакете = СтекИтоговыхЗапросов - 1;
	//		
	//	ИначеЕсли Область = "ДиаграммаЦены" И РазрешенПросмотрЦен Тогда
	//		
	//		Если ЗначениеЗаполнено(Запрос.Текст) Тогда
	//			Запрос.Текст = Запрос.Текст + РазделительЗапросов;
	//		КонецЕсли;
	//		
	//		Запрос.Текст = Запрос.Текст + ЗапросТекстДинамикаЦен;
	//		СтекИтоговыхЗапросов = СтекИтоговыхЗапросов + ЗапросТекстДинамикаЦенНомерВПакете;
	//		ЗапросТекстДинамикаЦенНомерВПакете = СтекИтоговыхЗапросов - 1;
	//		
	//		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ПериодДетализации%", текстДиаграммаЦеныПериодичность);
	//		Если ЗначениеЗаполнено(ДиаграммаЦеныПериод.ДатаНачала) Тогда
	//			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДиаграммаЦеныДатаНачала", "ЦеныНоменклатуры.Период >= &ДиаграммаЦеныДатаНачала");
	//			Запрос.УстановитьПараметр("ДиаграммаЦеныДатаНачала", ДиаграммаЦеныПериод.ДатаНачала);
	//		Иначе
	//			Запрос.УстановитьПараметр("ДиаграммаЦеныДатаНачала", Истина);
	//		КонецЕсли;
	//		Если ЗначениеЗаполнено(ДиаграммаЦеныПериод.ДатаОкончания) Тогда
	//			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДиаграммаЦеныДатаОкончания", "ЦеныНоменклатуры.Период <= &ДиаграммаЦеныДатаОкончания");
	//			Запрос.УстановитьПараметр("ДиаграммаЦеныДатаОкончания", ДиаграммаЦеныПериод.ДатаОкончания);
	//		Иначе
	//			Запрос.УстановитьПараметр("ДиаграммаЦеныДатаОкончания", Истина);
	//		КонецЕсли;
	//		
	//	ИначеЕсли Область = "ДиаграммаПродажи" И РазрешенПросмотрПродаж Тогда
	//		
	//		Если НЕ ЗапросПродаж Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		Если ЗначениеЗаполнено(Запрос.Текст) Тогда
	//			Запрос.Текст = Запрос.Текст + РазделительЗапросов;
	//		КонецЕсли;
	//		
	//		Запрос.Текст = Запрос.Текст + ЗапросТекстДинамикаПродаж;
	//		СтекИтоговыхЗапросов = СтекИтоговыхЗапросов + ЗапросТекстДинамикаПродажНомерВПакете;
	//		ЗапросТекстДинамикаПродажНомерВПакете = СтекИтоговыхЗапросов - 1;
	//		
	//		Если ДиаграммаПродажиПериодичность = ТипЕдиницыИнтервалаВремениАнализаДанных.День Тогда
	//			Запрос.Текст = СтрЗаменить(Запрос.Текст, "%Период%", "ПродажиОбороты.ПериодДень");
	//		ИначеЕсли ДиаграммаПродажиПериодичность = ТипЕдиницыИнтервалаВремениАнализаДанных.Неделя Тогда
	//			Запрос.Текст = СтрЗаменить(Запрос.Текст, "%Период%", "ПродажиОбороты.ПериодНеделя");
	//		ИначеЕсли ДиаграммаПродажиПериодичность = ТипЕдиницыИнтервалаВремениАнализаДанных.Месяц Тогда
	//			Запрос.Текст = СтрЗаменить(Запрос.Текст, "%Период%", "ПродажиОбороты.ПериодМесяц");
	//		ИначеЕсли ДиаграммаПродажиПериодичность = ТипЕдиницыИнтервалаВремениАнализаДанных.Квартал Тогда
	//			Запрос.Текст = СтрЗаменить(Запрос.Текст, "%Период%", "ПродажиОбороты.ПериодКвартал");
	//		ИначеЕсли ДиаграммаПродажиПериодичность = ТипЕдиницыИнтервалаВремениАнализаДанных.Год Тогда
	//			Запрос.Текст = СтрЗаменить(Запрос.Текст, "%Период%", "ПродажиОбороты.ПериодГод");
	//		КонецЕсли;
	//		Запрос.УстановитьПараметр("ДиаграммаПродажиДатаНачала", ДиаграммаПродажиПериод.ДатаНачала);
	//		Запрос.УстановитьПараметр("ДиаграммаПродажиДатаОкончания", ДиаграммаПродажиПериод.ДатаОкончания);
	//		
	//	ИначеЕсли Область = "Остатки" И РазрешенПросмотрОстатков Тогда
	//		
	//		Если ЗначениеЗаполнено(Запрос.Текст) Тогда
	//			Запрос.Текст = Запрос.Текст + РазделительЗапросов;
	//		КонецЕсли;
	//		
	//		Запрос.Текст = Запрос.Текст + ЗапросТекстОстатки;
	//		СтекИтоговыхЗапросов = СтекИтоговыхЗапросов + ЗапросТекстОстаткиНомерВПакете;
	//		ЗапросТекстОстаткиНомерВПакете = СтекИтоговыхЗапросов - 1;
	//		
		КонецЕсли;
	КонецЦикла;
	//
	Запрос.УстановитьПараметр("Имущество", Объект.Ссылка);
	//
	Результат = Запрос.ВыполнитьПакет();
	//
	Если Области.Найти("АктуальныеЦены") <> Неопределено Тогда
		//ИнициализироватьДиаграммуЦены();
		ЗаполнитьАктуальныеЦены(Результат[ЗапросТекстАктуальныеЦеныНомерВПакете]);
	КонецЕсли;
	//
	//Если Области.Найти("ДиаграммаЦены") <> Неопределено Тогда
	//	ЗаполнитьДиаграммуЦены(Результат[ЗапросТекстДинамикаЦенНомерВПакете]);
	//КонецЕсли;
	//
	//Если Области.Найти("ДиаграммаПродажи") <> Неопределено Тогда
	//	Если ЗапросПродаж Тогда
	//		ЗаполнитьДиаграммуПродажи(Результат[ЗапросТекстДинамикаПродажНомерВПакете]);
	//	Иначе
	//		ИнициализироватьДиаграммуПродажиПустую();
	//	КонецЕсли;
	//КонецЕсли;
	//
	//Если Области.Найти("Остатки") <> Неопределено Тогда
	//	ЗаполнитьОстатки(Результат[ЗапросТекстОстаткиНомерВПакете]);
	//КонецЕсли;
	
КонецПроцедуры // ПолучитьДанныеФормы()

// Обновляет данные о ценах при возникновении оповещения об изменении цены.
//
&НаСервере
Процедура ОбработкаОповещенияЗаписьВРегистреЦен()
	
	АктуальныеЦеныУдалитьЭлементы();
	
	ДиаграммаЦеныПериод = Неопределено;
	//ДиаграммаЦеныУстановитьЗаголовокПериода();
	
	Области = Новый Массив;
	Области.Добавить("АктуальныеЦены");
	//Области.Добавить("ДиаграммаЦены");
	ПолучитьДанныеФормы(Области);
	
КонецПроцедуры


// Герерирует надписи со значениями актуальных цен в группе АктуальныеЦены.
//
// Параметры:
//  Данные - РезультатЗапроса - Результат выполнения запроса. Подготавливается в процедуре ПолучитьДанныеФормы().
//
&НаСервере
Процедура ЗаполнитьАктуальныеЦены(Данные)
	
	ДиаграммаЦены.Очистить();
	АктуальныеЦены.Очистить();
	
	Цены = Данные.Выгрузить();
	Если Цены.Количество() = 0 Тогда
		Элементы.ДекорацияЦеныНеУстановлены.Видимость = Истина;
		Возврат;
	Иначе
		Элементы.ДекорацияЦеныНеУстановлены.Видимость = Ложь;
	КонецЕсли;
	
	СоставСтроки = Новый Массив;
	ФорматнаяСтрока = "";
	
	Итератор = 0;
	НациональнаяВалюта = Константы.НациональнаяВалюта.Получить();
	Цены.Колонки.Добавить("ЦенаВНациональнойВалюте");
	
	Для каждого Цена Из Цены Цикл
		
		//Если Цена.ВидЦен.ВалютаЦены <> НациональнаяВалюта Тогда
			Цена.ЦенаВНациональнойВалюте = Цена.Цена; //ПересчитатьПоВыбраннойВалюте(Цена.ВидЦен.ВалютаЦены, ТекущаяДатаСеанса(), Цена.Цена, НациональнаяВалюта);
		//Иначе
		//	Цена.ЦенаВНациональнойВалюте = Цена.Цена;
		//КонецЕсли;
		
	КонецЦикла;
	
	Цены.Сортировать("ЦенаВНациональнойВалюте Убыв");
	Итератор = 0;
	Для каждого Цена Из Цены Цикл
		
		НоваяСтрока = АктуальныеЦены.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Цена);
		
		Цвет = Новый Цвет(0,0,255);//ЦветВидаЦен(Цена.ВидЦен);
		
		Группа = Элементы.Добавить("ГруппаАктуальныеЦены" + Итератор, Тип("ГруппаФормы"), Элементы.АктуальныеЦены);
		Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
		Группа.ОтображатьЗаголовок = Ложь;
		Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		
		СоставСтроки.Очистить();
		//СоставСтроки.Добавить(Новый ФорматированнаяСтрока(" " + Лев(Цена.ВидЦен.Наименование, 1), , Цвет));
		//СоставСтроки.Добавить(Новый ФорматированнаяСтрока(Прав(Цена.ВидЦен.Наименование, СтрДлина(Цена.ВидЦен.Наименование) - 1),, Цвет));
		СоставСтроки.Добавить(Новый ФорматированнаяСтрока(" ", , Цвет));
		СоставСтроки.Добавить(Новый ФорматированнаяСтрока(" ",, Цвет));
		
		НоваяДекорация = Элементы.Добавить("АктуальнаяЦенаВидЦен" + Итератор, Тип("ДекорацияФормы"), Группа);
		НоваяДекорация.Вид = ВидДекорацииФормы.Надпись;
		НоваяДекорация.Заголовок = Новый ФорматированнаяСтрока(СоставСтроки, Новый Шрифт(, 10));
		НоваяДекорация.АвтоМаксимальнаяШирина = Ложь;
		НоваяДекорация.МаксимальнаяШирина = 22;
		НоваяДекорация.РастягиватьПоГоризонтали = Истина;
		НоваяДекорация.Высота = 1;
		НоваяДекорация.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Центр;
		
		СоставСтроки.Очистить();
		ФорматированноеЧисло = Формат(Цена.Цена, ФорматнаяСтрока);
		Если Истина Тогда
			//СоставСтроки.Добавить(Новый ФорматированнаяСтрока(ФорматированноеЧисло,, ЦветаСтиля.ЦветГиперссылки,, Строка(Цена.ВидЦен.Ссылка.УникальныйИдентификатор())));
			СоставСтроки.Добавить(Новый ФорматированнаяСтрока(ФорматированноеЧисло,, ЦветаСтиля.ЦветГиперссылки,, Строка(Новый УникальныйИдентификатор)));
		Иначе
			СоставСтроки.Добавить(Новый ФорматированнаяСтрока(ФорматированноеЧисло));
		КонецЕсли;
		
		НоваяДекорация = Элементы.Добавить("АктуальнаяЦенаЗначениеЦены" + Итератор, Тип("ДекорацияФормы"), Группа);
		НоваяДекорация.Вид = ВидДекорацииФормы.Надпись;
		
		НоваяДекорация.Заголовок = Новый ФорматированнаяСтрока(СоставСтроки, Новый Шрифт(, 10));
		НоваяДекорация.АвтоМаксимальнаяШирина = Ложь;
		НоваяДекорация.МаксимальнаяШирина = 10;
		НоваяДекорация.РастягиватьПоГоризонтали = Истина;
		НоваяДекорация.Высота = 1;
		НоваяДекорация.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
		НоваяДекорация.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Центр;
		НоваяДекорация.УстановитьДействие("ОбработкаНавигационнойСсылки", "Подключаемый_ЗаголовокЗначенияЦенОбработкаНавигационнойСсылки");
		
		СоставСтроки.Очистить();
		ФорматированноеЧисло = Формат(Цена.Цена, ФорматнаяСтрока);
		//СоставСтроки.Добавить(Новый ФорматированнаяСтрока(" " + Цена.ВидЦен.ВалютаЦены.Наименование, ));
		СоставСтроки.Добавить(Новый ФорматированнаяСтрока(" ", ));
		
		НоваяДекорация = Элементы.Добавить("АктуальнаяЦенаВалютаЦены" + Итератор, Тип("ДекорацияФормы"), Группа);
		НоваяДекорация.Вид = ВидДекорацииФормы.Надпись;
		НоваяДекорация.Заголовок = Новый ФорматированнаяСтрока(СоставСтроки, Новый Шрифт(, 10));
		НоваяДекорация.АвтоМаксимальнаяШирина = Ложь;
		НоваяДекорация.МаксимальнаяШирина = 6;
		НоваяДекорация.РастягиватьПоГоризонтали = Истина;
		НоваяДекорация.Высота = 1;
		НоваяДекорация.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
		НоваяДекорация.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Центр;
		
		Итератор = Итератор + 1;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьАктуальныеЦены()

#КонецОбласти

#Область ОбработчикиСобытийДиаграмм

&НаКлиенте
Процедура ДиаграммаЦеныПериодЗаголовокНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период = ДиаграммаЦеныПериод;
	Описание = Новый ОписаниеОповещения("ДиаграммаЦеныПериодЗаголовокНажатиеЗавершение", ЭтотОбъект);
	Диалог.Показать(Описание);
	
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаЦеныПериодЗаголовокНажатиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДиаграммаЦеныПериодЗаголовокНажатиеЗавершениеНаСервере(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ДиаграммаЦеныПериодЗаголовокНажатиеЗавершениеНаСервере(Результат)
	
	ДиаграммаЦеныПериод = Результат;
	//ПодходящаяПериодичность = ПодходящаяПериодичность(Результат.ДатаНачала, Результат.ДатаОкончания);
	//ДиаграммаЦеныУстановитьПериодичность(ПодходящаяПериодичность);
	
	//ДиаграммаЦеныУстановитьЗаголовокПериода();
	ПолучитьДанныеФормы("ДиаграммаЦены");
	
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаПродажиПериодЗаголовокНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	//Диалог.Период = ДиаграммаПродажиПериод;
	Описание = Новый ОписаниеОповещения("ДиаграммаПродажиПериодЗаголовокНажатиеЗавершение", ЭтотОбъект);
	Диалог.Показать(Описание);
	
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаПродажиПериодЗаголовокНажатиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДиаграммаПродажиПериодЗаголовокНажатиеЗавершениеНаСервере(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ДиаграммаПродажиПериодЗаголовокНажатиеЗавершениеНаСервере(Результат)
	
	ДиаграммаПродажиПериод = Результат;
	//ПодходящаяПериодичность = ПодходящаяПериодичность(Результат.ДатаНачала, Результат.ДатаОкончания);
	//ДиаграммаПродажиУстановитьПериодичность(ПодходящаяПериодичность);
	//ДиаграммаПродажиУстановитьЗаголовокПериода();
	ПолучитьДанныеФормы("ДиаграммаПродажи");
	
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаПродажиОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДатаНачала = Расшифровка.Период;
	Периодичность = Расшифровка.Периодичность;
	ДиаграммаПродажиОбработкаРасшифровкиНаСервере(ДатаНачала, Периодичность);
	
КонецПроцедуры

&НаСервере
Процедура ДиаграммаПродажиОбработкаРасшифровкиНаСервере(ДатаНачала, Периодичность)
	
	Если Периодичность = ТипЕдиницыИнтервалаВремениАнализаДанных.День Тогда
		Возврат;
	ИначеЕсли Периодичность = ТипЕдиницыИнтервалаВремениАнализаДанных.Неделя Тогда
		ДатаОкончания = КонецНедели(ДатаНачала);
	ИначеЕсли Периодичность = ТипЕдиницыИнтервалаВремениАнализаДанных.Месяц Тогда
		ДатаОкончания = КонецМесяца(ДатаНачала);
	ИначеЕсли Периодичность = ТипЕдиницыИнтервалаВремениАнализаДанных.Квартал Тогда
		ДатаОкончания = КонецКвартала(ДатаНачала);
	ИначеЕсли Периодичность = ТипЕдиницыИнтервалаВремениАнализаДанных.Год Тогда
		ДатаОкончания = КонецГода(ДатаНачала);
	КонецЕсли;
	
	ДиаграммаПродажиПериод = Новый СтандартныйПериод(ДатаНачала, ДатаОкончания);
	//ДиаграммаПродажиУстановитьЗаголовокПериода();
	//ПодходящаяПериодичность = ПодходящаяПериодичность(ДатаНачала, ДатаОкончания);
	//ДиаграммаПродажиУстановитьПериодичность(ПодходящаяПериодичность);
	ПолучитьДанныеФормы("ДиаграммаПродажи");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещенияЗаписьВРегистреЦенКлиент()
	
	ОбработкаОповещенияЗаписьВРегистреЦен();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	//Вставить содержимое обработчика
КонецПроцедуры


#КонецОбласти
